In [1]:
import pandas as pd
import requests
import random
import json
from bs4 import BeautifulSoup
import re
from sqlalchemy import create_engine
from sqlalchemy.pool import StaticPool
import numpy as np

In [221]:
def acquire (path: str):
    db_connection = create_engine(f'sqlite:///{path}', poolclass=StaticPool)
    data_table = pd.read_sql_query('SELECT\
                                    country_info.uuid,\
                                    country_info.country_code,\
                                    country_info.rural as habitat,\
                                    career_info.dem_education_level as education_level,\
                                    career_info.normalized_job_code as job_code,\
                                    personal_info.gender,\
                                    personal_info.age,\
                                    personal_info.age_group \
                                    from country_info\
                                    join career_info \
                                    on country_info.uuid = career_info.uuid\
                                    join personal_info \
                                    on career_info.uuid = personal_info.uuid', con=db_connection)
    data_table
    return data_table

In [234]:
data_table=acquire('./raw_data_project_m1.db')

data_table

,uuid,country_code,habitat,education_level,job_code,gender,age,age_group
0,f6e7ee00-deac-0133-4de8-0a81e8b09a82,AT,countryside,no,None,male,61 years old,40_65
1,54f0f1c0-dda1-0133-a559-0a81e8b09a82,AT,urban,high,861a9b9151e11362eb3c77ca914172d0,male,57 years old,40_65
2,83127080-da3d-0133-c74f-0a81e8b09a82,AT,city,None,None,male,32 years old,26_39
3,15626d40-db13-0133-ea5c-0a81e8b09a82,AT,Country,high,049a3f3a2b5f85cb2971ba77ad66e10c,Male,45 years old,40_65
4,24954a70-db98-0133-4a64-0a81e8b09a82,AT,city,high,f4b2fb1aa40f661488e2782b6d57ad2f,Fem,41 years old,40_65
...,...,...,...,...,...,...,...,...
9644,7d1ac020-dcb4-0133-817a-0a81e8b09a82,SK,urban,high,847165cfda6b1dc82ae22b967da8af2f,FeMale,37 years old,26_39
9645,39f989f0-db52-0133-8482-0a81e8b09a82,SK,urban,high,a4d5b8b38f9513825d0d94a981ebe962,Male,53 years old,40_65
9646,70ce4a90-d965-0133-f5e4-0a81e8b09a82,SK,Non-Rural,low,None,male,1992,juvenile
9647,2896e440-db3c-0133-5b67-0a81e8b09a82,SK,city,low,775190277a849cba701b306a7b374c0a,male,47 years old,40_65
9648,06217ba0-dd56-0133-edda-0a81e8b09a82,SK,city,high,8a7a3f1bce0958ae9f090683e5a925b7,FeMale,51 years old,40_65

In [235]:
def habitat_table(data_table):
    data_table['habitat']=data_table['habitat'].str.lower()
    data_table['habitat']=data_table['habitat'].str.replace('city', 'urban').str.replace('countryside', 'non-urban').str.replace('country', 'non-urban').str.replace('non-rural','urban').str.replace('rural','non-urban')
    return data_table

In [236]:
data_table2=habitat_table(data_table)

In [237]:
data_table2['gender'].unique()

array(['male', 'Male', 'Fem', 'FeMale', 'female'], dtype=object)

In [238]:
def gender(data_table): 
    data_table['gender']=data_table['gender'].str.replace('Fem', 'female')
    data_table['gender']=data_table['gender'].str.lower()
    return data_table

In [265]:
data_table3=gender(data_table2)

In [76]:
data_table['age'].unique()

array(['61 years old', '57 years old', '32 years old', '45 years old',
       '41 years old', '1990', '47 years old', '34 years old', '1994',
       '49 years old', '58 years old', '1991', '40 years old',
       '37 years old', '48 years old', '31 years old', '1999', '1989',
       '2001', '35 years old', '51 years old', '1988', '42 years old',
       '33 years old', '64 years old', '38 years old', '55 years old',
       '1992', '1993', '36 years old', '46 years old', '1998',
       '44 years old', '1996', '65 years old', '1995', '52 years old',
       '2002', '50 years old', '1997', '43 years old', '1987', '1986',
       '39 years old', '53 years old', '62 years old', '2000',
       '54 years old', '56 years old', '59 years old', '60 years old',
       '63 years old'], dtype=object)

In [283]:
def age (data_table):
    if len(data_table)==4:
        x= np.subtract(2016,int(data_table))
        return f'{str(x)} years old'
    else:
        return data_table
      
 

    




#lambda m: str(int(m.group(1))+int(m.group(2)

In [285]:
data_table3['age'].apply(age)

0       61 years old
1       57 years old
2       32 years old
3       45 years old
4       41 years old
            ...
9644    37 years old
9645    53 years old
9646    24 years old
9647    47 years old
9648    51 years old
Name: age, Length: 9649, dtype: object